ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC6_UART_1.0.xml
        </group>
    <group id="UC6_UART_DMA_TRIG_RX" name="UC6_UART_DMA_TRIG_RX" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="UC6_UART_DMA_TRIG_RX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RTOUT" description="Enable UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXINT" description="Enable UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC6_UART_DMA_TRIG_RX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RTOUT" description="UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXINT" description="UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC6_UART_DMA_TRIG_RX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RTOUT" description="Masked UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXINT" description="Masked UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC6_UART_DMA_TRIG_RX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RTOUT" description="Set UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RXINT" description="Set UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        </group>
    <group id="UC6_UART_DMA_TRIG_TX" name="UC6_UART_DMA_TRIG_TX" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="UC6_UART_DMA_TRIG_TX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TXINT" description="Enable UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC6_UART_DMA_TRIG_TX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TXINT" description="UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC6_UART_DMA_TRIG_TX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TXINT" description="Masked UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC6_UART_DMA_TRIG_TX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TXINT" description="Set UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        </group>
    <register id="UC6_UART_INTCTL" width="32" offset="0x10E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="UC6_UART_CTL0" width="32" offset="0x1100" description="UART Control Register 0">
        <bitfield id="ENABLE" description="UART Module Enable.  If the UART is disabled in the middle of transmission or reception, it completes the current character before stopping. 
If the ENABLE bit is not set, all registers can still be accessed and updated. It is recommended to setup and change the UART operation mode with having the ENABLE bit cleared to avoid unpredictable behavior during the setup or update.
If disabled the UART module will not send or receive any data and the logic is held in reset state." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Module"/>
            <bitenum id="ENABLE" value="0x1" description="Enable module"/>
        </bitfield>
        <bitfield id="HSE" description="High-Speed Bit Oversampling Enable   #b#NOTE:#/b# The bit oversampling influences the UART baud-rate configuration.  The state of this bit has no effect on clock generation in ISO7816 smart card mode (the SMART bit is set)." begin="16" end="15" width="2" rwaccess="R/W">
            <bitenum id="OVS16" value="0x0" description="16x oversampling."/>
            <bitenum id="OVS8" value="0x1" description="8x oversampling."/>
            <bitenum id="OVS3" value="0x2" description="3x oversampling. IrDA, Manchester and DALI not supported when 3x oversampling is enabled."/>
        </bitfield>
        <bitfield id="LBE" description="UART Loop Back Enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal operation."/>
            <bitenum id="ENABLE" value="0x1" description="The UARTxTX path is fed through the UARTxRX path internally."/>
        </bitfield>
        <bitfield id="RXE" description="UART Receive Enable  If the UART is disabled in the middle of a receive, it completes the current character before stopping.   #b#NOTE:#/b# To enable reception, the UARTEN bit must be set." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The receive section of the UART is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The receive section of the UART is enabled."/>
        </bitfield>
        <bitfield id="TXE" description="UART Transmit Enable  If the UART is disabled in the middle of a transmission, it completes the current character before stopping.   #b#NOTE:#/b# To enable transmission, the UARTEN bit must be set." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The transmit section of the UART is disabled. The UARTxTXD pin of the UART can be controlled by the TXD_CTL bit when enabled."/>
            <bitenum id="ENABLE" value="0x1" description="The transmit section of the UART is enabled."/>
        </bitfield>
        <bitfield id="RTS" description="Request to Send   
If RTSEN is set the RTS output signals is controlled by the hardware logic using the FIFO fill level or buffer status. 
If RTSEN is cleared the RTS output is controlled by the RTS bit. The bit is the complement of the UART request to send, RTS modem status output." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Signal not RTS"/>
            <bitenum id="SET" value="0x1" description="Signal RTS"/>
        </bitfield>
        <bitfield id="RTSEN" description="Enable hardware controlled Request to Send" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="RTS hardware flow control is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="RTS hardware flow control is enabled. Data is only requested (by asserting UARTxRTS) when the receive FIFO/buffer has available entries."/>
        </bitfield>
        <bitfield id="CTSEN" description="Enable Clear To Send" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="CTS hardware flow control is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="CTS hardware flow control is enabled. Data is only transmitted when the UARTxCTS signal is asserted."/>
        </bitfield>
        <bitfield id="MODE" description="Set the communication mode and protocol used.
(Not defined settings uses the default setting: 0)" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="UART" value="0x0" description="Normal operation"/>
            <bitenum id="RS485" value="0x1" description="RS485 mode: UART needs to be IDLE with receiving data for the in EXTDIR_HOLD set time. EXTDIR_SETUP defines the time the RTS line is set to high before sending. When the buffer is empty the RTS line is set low again. A transmit will be delayed as long the UART is receiving data."/>
            <bitenum id="IDLELINE" value="0x2" description="The UART operates in IDLE Line Mode"/>
            <bitenum id="ADDR9BIT" value="0x3" description="The UART operates in 9 Bit Address mode"/>
            <bitenum id="SMART" value="0x4" description="ISO7816 Smart Card Support  The application must ensure that it sets 8-bit word length (WLEN set to 3h) and even parity (PEN set to 1, EPS set to 1, SPS set to 0) in UARTLCRH when using ISO7816 mode. The value of the STP2 bit in UARTLCRH is ignored and the number of stop bits is forced to 2."/>
            <bitenum id="DALI" value="0x5" description="DALI Mode:"/>
        </bitfield>
        <bitfield id="TXD_OUT" description="TXD Pin Control Controls the TXD pin when TXD_OUT_EN = 1 and TXE = 0." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="TXD pin is low"/>
            <bitenum id="HIGH" value="0x1" description="TXD pin is high"/>
        </bitfield>
        <bitfield id="TXD_OUT_EN" description="TXD Pin Control Enable. When the transmit section of the UART is disabled (TXE = 0), the TXD pin can be controlled by the TXD_OUT bit." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="TXD pin can not be controlled by TXD_OUT"/>
            <bitenum id="ENABLE" value="0x1" description="TXD pin can be controlled by TXD_OUT"/>
        </bitfield>
        <bitfield id="MAJVOTE" description="Majority Vote Enable 
When Majority Voting is enabled, the three center bits are used to determine received sample value. In case of error (i.e. all 3 bits are not the same), noise error is detected and bits RIS.NERR and register RXDATA.NERR are set.
     Oversampling of 16 : bits 7, 8, 9 are used
     Oversampling of 8 : bits 3, 4, 5 are used
Disabled : Single sample value (center value) used" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Majority voting is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Majority voting is enabled"/>
        </bitfield>
        <bitfield id="MSBFIRST" description="Most Significant Bit First
This bit has effect both on the way protocol byte is transmitted and received.
Notes: User needs to match the protocol to the correct value of this bit to send MSb or LSb first. The hardware engine will send the byte entirely based on this bit." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Least significant bit is sent first in the protocol packet"/>
            <bitenum id="ENABLE" value="0x1" description="Most significant bit is sent first in the protocol packet"/>
        </bitfield>
    </register>
